# -*- coding: utf-8 -*-
"""
Created on Mon Mar  4 15:52:43 2024

@author: Shin
"""

#실수(float)
#부동 소숫점 형태
#지수 형태 

#원주율
pi = 3.141592
print(type(pi), pi)  # <class 'str'> 1234
#%%

# 지수형태
a = 0.123E3
print(type(a), a) # <class 'float'> 123.0
# 연산자 우선순위에 의해서 결과가 달라진다.
b= 0.123 * (10 ** 3) 
# = 0.123 * 10 ** 3 
c = 0.123 * 10
d = c ** 3
print (c, d) # 1.23 1.8608669999999998

#%%
# 10의 10승 (.0 -> 실수형 처리할 떄)
x= 10000000000.0 
y= 10 *10 *10 *10 *10 *10 *10 *10 *10 *10.0
z= 1.0e10 
print(x) # 10000000000.0
print(y) # 10000000000.0
print(z) # 10000000000.0

#%%

# 0.123 * 10의 -3승
# 0.000123
m = 0.123e-3
print(m) # 0.000123
