# Array: 다차원 배열
# 행, 열, 면
#생성함수 : array()

c12 <- c(1:12) #12개의 요소
adm <- c(3,2,2) #3*2*2
ax <- array(c12,adm)
ax
#1면: , , 1 
# 
#       [,1] [,2]
# [1,]    1    4
# [2,]    2    5
# [3,]    3    6
# 
#2면 , , 2 
# 
#       [,1] [,2]
# [1,]    7   10
# [2,]    8   11
# [3,]    9   12

mode(ax) #numeric
class(ax) #array 

#면 참조
ax[,,1] #1면
ax[,,2] #2면

#열단위 
ax[,1,1] #1열 1면 <- <- <- <- <- 

#행단위
ax[1,,1] #1행, 모든 열, 1면: 1 4

#행, 열, 면
ax[1,1,1] # 1
ax[1,2,1] # 4

#범위지정
ax[1,,1:2] : 1행, 모든 열, 모든 면
ax
#       [,1] [,2]
# [1,]    1    7
# [2,]    4   10
