
# #### 열 데이터 선택

# [5장: 193페이지]

# In[ ]:
import pandas as pd
import numpy as np

dict_data = { '제품ID':['P501', 'P502', 'P503', 'P504', 'P505', 'P506', 'P507'],
              '판매가격':[6400, 5400, 9400, 10400, 9800, 1200, 3400],
              '판매량':[63, 56, 98, 48, 72, 59, 43],
              '이익률':[0.30, 0.21, 0.15, 0.25, 0.45, 0.47, 0.32]}  # 딕셔너리 데이터

df2 = pd.DataFrame(dict_data)
df2

psid = df2['제품ID'] # series


# [5장: 194페이지]

# In[ ]:


pdid = df2[['제품ID']] # dataframe


# In[ ]:


df2[['제품ID', '이익률', '판매가격']]




